# 타이타닉 생존자 데이터 분석

## 타이타닉호에서 어떤 승객이 생존했는지 데이터로부터 분석


1912년 4월 15일 타이타닉호 침몰로 2224명중 1502이 사망했다. 생존한 승객이 성별, 나이, 선실 등급과 어떤 관계가 있었는지를 분석한다.


## 주어진 데이터 내용

  * **Survival** - Survival. 0 = No, 1 = Yes
  * **Pclass** - Ticket class. 1 = 1st, 2 = 2nd, 3 = 3rd
  * **Sex** - Sex.
  * **Age** - Age in years.
  * **SibSp** - # of siblings / spouses aboard the Titanic.
  * **Parch** - # of parents / children aboard the Titanic.
  * **Ticket** - Ticket number.
  * **Fare** - Passenger fare.
  * **Cabin** - Cabin number.
  * **Embarked** - Port of Embarkation. C = Cherbourg, Q = Queenstown, S = Southampton

## Load Dataset

'titanic_train.csv' 파일을 읽어서 변수 train에 저장하고,

PassengerId를 index로 지정

In [197]:
seed = 37

In [198]:
import pandas as pd
import numpy as np

'titanic_test.csv' 파일을 읽어서 변수 test에 저장하고,

PassengerId를 index로 지정

In [199]:
data = pd.read_csv('data/titanic_test.csv')
data

data.index = data.PassengerId  
# 파일을 불러올때 indexcol 옵션을 통해 한번에 불러 올 수도 있음 
data.head()

data_tst = data.drop(['PassengerId'], axis = 1)
data_tst.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Preprocessing

### Encode Sex

'Sex_encode'라는 이름의 column을 생성하고 성별이 남자면 0, 여자면 1로 코딩

(train, test 둘 다 적용)

- .loc 활용

In [200]:
print(data_tst.columns[2])
len(data_tst)
data_tst.loc[892,"Sex"]
# data_tst

Sex

'male'

In [201]:
data_tst['Sex_encode'] = 3
# data_tst.head()

In [202]:
# My solution
# for i in range(892,892+len(data_tst)):
#     if data_tst.loc[i,"Sex"] == 'male' : 
#         data_tst.loc[i,'Sex_encode'] = 0
        
#     else : 
#          data_tst.loc[i,'Sex_encode'] = 1

# data_tst.head()

In [203]:
# Woobin's soution

data_tst.loc[data_tst['Sex'] == 'male', 'Sex_encode'] = 0
data_tst.loc[data_tst['Sex'] == 'female', 'Sex_encode'] = 1

data_tst.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_encode
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [204]:
# titanic_train 데이터도 수행
data2 = pd.read_csv('data/titanic_train.csv')
data2

data2.index = data2.PassengerId
data2

data_trn = data2.drop('PassengerId', axis=1)


data_trn['Sex_encode'] = 3
data_trn.loc[data_trn['Sex'] == 'male', 'Sex_encode'] = 0 
data_trn.loc[data_trn['Sex'] == 'female', 'Sex_encode'] = 1

data_trn.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_encode
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

### Fill in missing fare
#### - delete row or filling in missing fare(mean)

train, test 모두 'Fare_fillin'이라는 이름의 column을 생성

missing(null)가 있는지 확인하고, missing value를 Fare 전체의 평균값으로 코딩

In [205]:
train["Fare_fillin"] = train["Fare"]
test["Fare_fillin"] = test["Fare"]

NameError: name 'test' is not defined

In [206]:
data_trn["Fare_fillin"] = data_trn["Fare"]
data_tst["Fare_fillin"] = data_tst["Fare"]

In [207]:
empty1 = data_tst.isnull()
#print(len(empty1[empty.Fare == True]))
#empty1.head()
empty2 = data_trn.isnull()
#print(len(empty2[empty2.Fare == True]))
#empty1.head()

#data_tst.Fare

data_tst.Fare.mean()

data_trn.loc[data_trn['Fare_fillin'].isnull() , 'Fare_fillin'] = data_trn.Fare.mean()
data_tst.loc[data_tst['Fare_fillin'].isnull() , 'Fare_fillin'] = data_tst.Fare.mean()


data_trn.Fare_fillin.isnull().unique()
data_tst.Fare_fillin.isnull().unique()

array([False])

### Encode Embarked

Embarked column의 값이 C일 때, Q일 때, S일 때 값이 1이 되도록 원핫인코딩

(train, test 둘 다 적용)
- .get_dummies 활용

In [210]:
data_tst.head()

tst_embarked = pd.get_dummies(data_tst["Embarked"], prefix="Embarked")
tst_embarked.head()

trn_embarked = pd.get_dummies(data_trn["Embarked"], prefix="Embarked")
trn_embarked.head()

# 아래와 같이 하면 별도 concat 필요 없음 ! 
# trn_embarked = pd.get_dummies(data=data_trn, columns=["Embarked"], prefix="Embarked")
# trn_embarked.head()

             Embarked_C  Embarked_Q  Embarked_S
PassengerId
1                     0           0           1
2                     1           0           0
3                     0           0           1
4                     0           0           1
5                     0           0           1

In [211]:
data_tst = pd.concat([data_tst, tst_embarked], axis=1)
data_tst.head()

data_trn = pd.concat([data_trn, trn_embarked], axis=1)
data_trn.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_encode,Fare_fillin,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,7.2500,0,0,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,71.2833,1,0,0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,7.9250,0,0,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,53.1000,0,0,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,8.0500,0,0,1

## Train

In [186]:
feature_names = ["Pclass", "Sex_encode", "Fare_fillin", "SibSp", "Parch",
                 "Embarked_C", "Embarked_Q", "Embarked_S"]

X_train = data_trn[feature_names]

print(X_train.shape)
X_train.head()

(891, 8)

,Pclass,Sex_encode,Fare_fillin,SibSp,Parch,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,
1,3,0,7.2500,1,0,0,0,1
2,1,1,71.2833,1,0,1,0,0
3,3,1,7.9250,0,0,0,0,1
4,1,1,53.1000,1,0,0,0,1
5,3,0,8.0500,0,0,0,0,1

In [185]:
label_name = "Survived"

y_train = data_trn[label_name]

print(y_train.shape)
y_train.head()

(891,)

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

In [176]:
from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier(max_depth=7,
                               random_state=seed)

In [177]:
model.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=7,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=37,
            splitter='best')

In [178]:
import pandas as pd

train = pd.read_csv("data/titanic_train.csv", index_col="PassengerId")

train["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [179]:
1 - (549 / 891) ** 2 - (342 / 891) ** 2

0.4730129578614428

## Predict

In [181]:
X_test = data_tst[feature_names]

print(X_test.shape)
X_test.head()

(418, 8)

,Pclass,Sex_encode,Fare_fillin,SibSp,Parch,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,
892,3,0,7.8292,0,0,0,1,0
893,3,1,7.0000,1,0,0,0,1
894,2,0,9.6875,0,0,0,1,0
895,3,0,8.6625,0,0,0,0,1
896,3,1,12.2875,1,1,0,0,1

In [182]:
prediction = model.predict(X_test)

print(prediction.shape)
prediction[:20]

(418,)

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1],
      dtype=int64)

In [183]:
sub = pd.DataFrame(prediction, columns=['Survived'], index=data_tst.index)

In [184]:
sub.to_csv('submission.csv')

#### 형 변환 방법 
test['cc'].astype(np.float32)